Сверт2.ОценкаСостоянияПредприятия/src/Documents/ПоказателиАналитики/ПоказателиАналитики.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоказателиАналитики</name>
  <registerRecords>InformationRegister.ПоказателяДляОценкиСостояния</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Показатели</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.Показатели</types>
      </type>
    </attributes>
    <attributes>
      <name>Формула</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Сверт2.ОценкаСостоянияПредприятия/src/InformationRegisters/ПоказателяДляОценкиСостояния/ПоказателяДляОценкиСостояния.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПоказателяДляОценкиСостояния</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.Показатели</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Сверт2.ОценкаСостоянияПредприятия/src/Documents/ПоказателиАналитики/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.ПоказателяДляОценкиСостояния.Записывать = Истина;
	Движения.Записать();
	Для Каждого ТекСтрокаПоказатели Из Показатели Цикл
		Движение = Движения.ПоказателяДляОценкиСостояния.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Показатель = ТекСтрокаПоказатели.Показатель;
		Движение.Сумма = ТекСтрокаПоказатели.Сумма;
	КонецЦикла;
    Движения.ПоказателяДляОценкиСостояния.Записать();
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
